package ex03;


public class Ex03 {
	public static void main(String[] args) {
		String s = "Anh yêu em không để em biết em còn chờ, Em xin lỗi em đã có thái độ không đúng với anh";

		String[] vnChars = { "á", "à", "ạ", "ả", "ã", "ă", "ắ", "ằ", "ặ", "ẳ", "ẵ", "â", "ấ", "ầ", "ậ", "ẩ", "ẫ", "é",
				"è", "ẹ", "ẻ", "ẽ", "ê", "ế", "ề", "ệ", "ể", "ễ", "í", "ì", "ị", "ỉ", "ĩ", "ó", "ò", "ọ", "ỏ", "õ", "ô",
				"ố", "ồ", "ộ", "ổ", "ỗ", "ơ", "ớ", "ờ", "ợ", "ở", "ỡ", "ú", "ù", "ụ", "ủ", "ũ", "ư", "ứ", "ừ", "ự", "ử",
				"ữ", "đ", "Á", "À", "Ạ", "Ả", "Ã", "Ă", "Ắ", "Ằ", "Ặ", "Ẳ", "Ẵ", "Â", "Ấ", "Ầ", "Ậ", "Ẩ", "Ẫ", "É", "È",
				"Ẹ", "Ẻ", "Ẽ", "Ê", "Ế", "Ề", "Ệ", "Ể", "Ễ", "Í", "Ì", "Ị", "Ỉ", "Ĩ", "Ó", "Ò", "Ọ", "Ỏ", "Õ", "Ô", "Ố",
				"Ồ", "Ộ", "Ổ", "Ỗ", "Ơ", "Ớ", "Ờ", "Ợ", "Ở", "Ỡ", "Ú", "Ù", "Ụ", "Ủ", "Ũ", "Ư", "Ứ", "Ừ", "Ự", "Ử", "Ữ",
				"Đ" };

		String[] chars = { "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "e",
				"e", "e", "e", "e", "e", "e", "e", "e", "e", "e", "i", "i", "i", "i", "i", "o", "o", "o", "o", "o", "o",
				"o", "o", "o", "o", "o", "o", "o", "o", "o", "o", "o", "u", "u", "u", "u", "u", "u", "u", "u", "u", "u",
				"u", "d", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "E", "E",
				"E", "E", "E", "E", "E", "E", "E", "E", "E", "I", "I", "I", "I", "I", "O", "O", "O", "O", "O", "O", "O",
				"O", "O", "O", "O", "O", "O", "O", "O", "O", "O", "U", "U", "U", "U", "U", "U", "U", "U", "U", "U", "U",
				"D" };

		
		String[] strings = s.split("");

		for (int i = 0; i < strings.length; i++) {
			for (int j = 0; j < vnChars.length; j++) {
				if (strings[i].equals(vnChars[j])) {
					strings[i] = chars[j];
				}
			}
			System.out.print(strings[i]);
		}

	}
}
